app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def new
        @articlelist = Article.all